<a href="https://colab.research.google.com/github/khalidakram07/Data_Sceince_for_beginners/blob/main/Dealing_with_missing_values_IMPUTATION_demo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [33]:
#Load libraries
import os
import pandas as pd
import numpy as np
import math

In [3]:
df = pd.read_csv("framingham.csv")

In [4]:
df.describe()

              male          age  ...      glucose   TenYearCHD
count  4238.000000  4238.000000  ...  3850.000000  4238.000000
mean      0.429212    49.584946  ...    81.966753     0.151958
std       0.495022     8.572160  ...    23.959998     0.359023
min       0.000000    32.000000  ...    40.000000     0.000000
25%       0.000000    42.000000  ...    71.000000     0.000000
50%       0.000000    49.000000  ...    78.000000     0.000000
75%       1.000000    56.000000  ...    87.000000     0.000000
max       1.000000    70.000000  ...   394.000000     1.000000

[8 rows x 16 columns]

In [6]:
df.isnull().sum()

male                 0
age                  0
education          105
currentSmoker        0
cigsPerDay          29
BPMeds              53
prevalentStroke      0
prevalentHyp         0
diabetes             0
totChol             50
sysBP                0
diaBP                0
BMI                 19
heartRate            1
glucose            388
TenYearCHD           0
dtype: int64

As we can see education column has 105missing values. For our understanding lets ignore other missing columns like cigperday,BpMeds,totChol,BMI,glucose.

In [11]:
df_focused=df[['male','age','education']]
df_focused

      male  age  education
0        1   39        4.0
1        0   46        2.0
2        1   48        1.0
3        0   61        3.0
4        0   46        3.0
...    ...  ...        ...
4233     1   50        1.0
4234     1   51        3.0
4235     0   48        2.0
4236     0   44        1.0
4237     0   52        2.0

[4238 rows x 3 columns]

In [12]:
df_focused.isnull().sum()

male           0
age            0
education    105
dtype: int64

In [ ]:
#usage of mean() on column named education.
missing_col1 = ['education']
for i in missing_col1:
 df_focused.loc[df.loc[:,i].isnull(),i]=df_focused.loc[:,i].mean()

Printing updated dataset to verify the mean() process.

In [14]:
df_focused.isnull().sum()

male         0
age          0
education    0
dtype: int64

Printing updated dataset to verify the median() on BPMeds column

In [ ]:
#Usage of median() on coumn named BPMeds from df dataframe
missing_col2 = ['BPMeds']
for i in missing_col2:
 df.loc[df.loc[:,i].isnull(),i]=df.loc[:,i].median()

In [35]:
median_=df[['male','age','BPMeds']]
median_.isnull().sum()

male      0
age       0
BPMeds    0
dtype: int64

In [43]:
#Using Knn imputer
df_knn=df[['male','glucose']]
from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler()
df_knn = pd.DataFrame(scaler.fit_transform(df_knn), columns = df_knn.columns)
df_knn.head()

   male   glucose
0   1.0  0.104520
1   0.0  0.101695
2   1.0  0.084746
3   0.0  0.177966
4   0.0  0.127119

In [44]:
#using Knn for imputation
from sklearn.impute import KNNImputer

from sklearn.impute import KNNImputer
imputer = KNNImputer(n_neighbors=5)
df_knn = pd.DataFrame(imputer.fit_transform(df_knn),columns = df_knn.columns)

In [45]:
df_knn.isna().any()

male       False
glucose    False
dtype: bool

In [46]:
print("count of NULL values after imputation\n")
df_knn.isnull().sum()

count of NULL values after imputation

male       0
glucose    0
dtype: int64